'use strict';

/*Создайте модуль pictures.js который с помощью функции window.load будет скачивать список похожих объявлений по адресу: https://intensive-javascript-server-myophkugvq.now.sh/kekstagram/data и сохранять их в массиве pictures.*/




/*В цикле пройдите по всем записям в массиве pictures и создайте для каждой из них DOM-элемент на основе шаблона, #picture-template который находится в разметке index.html.*/





/*Заполните каждый из созданных DOM-элементов информацией из соответствующего JavaScript-объекта: src для изображения возьмите из поля url, количество лайков из поля likes, количество комментариев — из длины массива comments.*/




/*Отрисуйте полученные блоки picture внутри блока pictures*/






/*В модуле pictures.js добавьте каждому из отрисованных элементов обработчик события клика (и активации с клавиатуры), который будет вызывать функцию showGallery передавая в нее данные соответствующего объекта*/